tap "hashicorp/tap"
brew "awscli"
brew "bat"
brew "duckdb"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "glab"
brew "go"
brew "go-task"
brew "helm"
brew "jj"
brew "jq"
brew "k9s"
brew "lazygit"
brew "neovim"
brew "nushell"
brew "nvm"
brew "ripgrep"
brew "opencode"
brew "pgcli"
brew "postgresql@16"
brew "skaffold"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "yazi"
brew "yq"
brew "zoxide"
brew "hashicorp/tap/terraform"
cask "altair-graphql-client"
cask "aws-vpn-client"
cask "font-jetbrains-mono-nerd-font"
cask "orbstack"
cask "postico"
cask "scroll-reverser"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
