tap "hashicorp/tap"
brew "awscli"
brew "bat"
brew "eza"
brew "fzf"
brew "gh"
brew "go-task"
brew "helm"
brew "jq"
brew "k9s"
brew "lazygit"
brew "neovim"
brew "nushell"
brew "nvm"
brew "postgresql@16"
brew "ripgrep"
brew "skaffold"
brew "stow"
brew "yazi"
brew "yq"
brew "zoxide"
brew "hashicorp/tap/terraform"
cask "altair-graphql-client"
cask "aws-vpn-client"
cask "font-jetbrains-mono-nerd-font"
cask "orbstack"
cask "postico"
cask "scroll-reverser"
