tap "adoptopenjdk/openjdk"
tap "coursier/formulas"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "lampepfl/brew"
tap "minio/stable"
tap "scalacenter/bloop"
tap "securityscorecard/repo"
tap "virtuslab/scala-cli"
brew "ammonite-repl"
brew "apache-spark"
brew "python@3.9"
brew "awscli"
brew "bat"
brew "c-blosc"
brew "chezmoi"
brew "dust"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "go"
brew "httpie"
brew "jfrog-cli"
brew "jq"
brew "kafka"
brew "kcat"
brew "libpq"
brew "moreutils"
brew "neovim"
brew "nghttp2"
brew "node"
brew "nvm"
brew "pgcli"
brew "postgresql"
brew "procs"
brew "ripgrep"
brew "sbt"
brew "scala"
brew "starship"
brew "terraform"
brew "tree"
brew "watch"
brew "yarn"
brew "zoxide"
brew "hashicorp/tap/vault"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "lampepfl/brew/dotty", link: false
brew "minio/stable/minio"
brew "scalacenter/bloop/bloop"
brew "securityscorecard/repo/okta2aws", args: ["HEAD"]
brew "virtuslab/scala-cli/scala-cli"
cask "adoptopenjdk11"
cask "alacritty"
cask "altair-graphql-client"
cask "amethyst"
cask "font-caskaydia-cove-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "visualvm"
