tap "agavra/tap"
tap "coursier/formulas"
tap "datadog-labs/pack"
tap "dmmulroy/tap"
tap "hashicorp/tap"
tap "jnsahaj/lumen"
tap "manaflow-ai/cmux"
tap "ryanmiville/tap"
tap "tansu-io/tap"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Lightweight, framework-agnostic database migration tool
brew "dbmate"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Language server for the Go language
brew "gopls"
# Kubernetes package manager
brew "helm"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Open-source distributed event streaming platform
brew "kafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# OpenID Connect authentication plugin for kubectl
brew "kubelogin"
# Simple terminal UI for git commands
brew "lazygit"
# HTTP/3 library written in C
brew "libnghttp3"
# IETF QUIC protocol implementation
brew "libngtcp2"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Modern shell for the GitHub era
brew "nushell"
# Manage multiple Node.js versions
brew "nvm"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Object-relational database system
brew "postgresql@16"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# GraphQL client
cask "altair-graphql-client"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf"
# Desktop client for GitHub repositories
cask "github"
# Keyboard customiser
cask "karabiner-elements"
# AI coding agent desktop client
cask "opencode-desktop"
# Replacement for Docker Desktop
cask "orbstack"
# GUI client for PostgreSQL databases
cask "postico"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Native database client for many database types
cask "tablepro"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
go "github.com/google/go-containerregistry/cmd/crane"
cargo "cargo-nextest"
uv "poetry"
uv "prek"
uv "pytest"
uv "ty"
uv "workers-py"
npm "corepack"
