tap "blackmann/brew"
brew "awscli"
brew "bat"
brew "dbmate"
brew "duckdb"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lua-language-server"
brew "node"
brew "neovim", link: false
brew "nushell"
brew "pgcli"
brew "postgresql"
brew "ripgrep"
brew "stow"
brew "terraform"
brew "watch"
brew "yazi"
brew "zoxide"
cask "font-jetbrains-mono-nerd-font"
vscode "a-h.templ"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "altimateai.vscode-altimate-mcp-server"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amodio.tsl-problem-matcher"
vscode "antfu.vite"
vscode "astro-build.astro-vscode"
vscode "astro-build.houston"
vscode "baccata.scaladex-search"
vscode "belfz.search-crates-io"
vscode "bierner.color-info"
vscode "bierner.docs-view"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "databricks.databricks"
vscode "dbaeumer.vscode-eslint"
vscode "degreat.theme-to-zed"
vscode "denoland.vscode-deno"
vscode "drcika.apc-extension"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "heybourn.headwind"
vscode "huang12zheng.protobuf-helper"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "innoverio.vscode-dbt-power-user"
vscode "jspolancor.presentationmode"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "naumovs.color-highlight"
vscode "otovo-oss.htmx-tags"
vscode "pascalsenn.keyboard-quickfix"
vscode "patbenatar.advanced-new-file"
vscode "postman.postman-for-vscode"
vscode "qufiwefefwoyn.kanagawa"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rstuven.iferrblocks"
vscode "rust-lang.rust-analyzer"
vscode "samplavigne.p5-vscode"
vscode "samuelcolvin.jinjahtml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sdras.night-owl"
vscode "silverquark.dancehelix"
vscode "sleistner.vscode-fileutils"
vscode "stivo.tailwind-fold"
vscode "svelte.svelte-vscode"
vscode "sysoev.vscode-open-in-github"
vscode "tamasfe.even-better-toml"
vscode "tobiah.language-pde"
vscode "tobias-z.vscode-harpoon"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
vscode "zxh404.vscode-proto3"
